In [2]:
import numpy as np
import pandas as pd

In [10]:
dict1={'Names':['Arghyanil','Sangeeta','Rohit',np.nan],'Age':[27,28,26,np.nan],'City':['Hyd','Jrd','Ghy','Del']}
d1=pd.DataFrame(dict1)
d1

       Names   Age City
0  Arghyanil  27.0  Hyd
1   Sangeeta  28.0  Jrd
2      Rohit  26.0  Ghy
3        NaN   NaN  Del

In [4]:
dict1={'Names':['Arghyanil','Sangeeta','Rohit',None],'Age':[27,28,26,None],'City':['Hyd','Jrd','Ghy','Del']}
d1=pd.DataFrame(dict1)
d1

       Names   Age City
0  Arghyanil  27.0  Hyd
1   Sangeeta  28.0  Jrd
2      Rohit  26.0  Ghy
3       None   NaN  Del

In [6]:
d1.isnull()

   Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3   True   True  False

In [8]:
d1.isnull().sum()

Names    1
Age      1
City     0
dtype: int64

- Generally data has some empty rows
- It is a data problem
- If you read that kind of data you will see null
- You need to understand that the data is corrupted or really a null value is there

**Method 1**

**Fill with some random value**

**Method name**: fill na

In [11]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City      0.0
dtype: float64

In [12]:
d1.fillna(40)

       Names   Age City
0  Arghyanil  27.0  Hyd
1   Sangeeta  28.0  Jrd
2      Rohit  26.0  Ghy
3         40  40.0  Del

**Method-2**

**- We can fill the values w.r.t columns also**

In [5]:
d1['Age'].fillna(40)
# it will not update
# inplace = False

0    27.0
1    28.0
2    26.0
3    40.0
Name: Age, dtype: float64

In [8]:
d1

       Names   Age City
0  Arghyanil  27.0  Hyd
1   Sangeeta  28.0  Jrd
2      Rohit  26.0  Ghy
3       None  40.0  Del

In [7]:
d1['Age'].fillna(40,inplace=True)

In [9]:
d1['Names'].fillna('Batman',inplace=True)
d1

       Names   Age City
0  Arghyanil  27.0  Hyd
1   Sangeeta  28.0  Jrd
2      Rohit  26.0  Ghy
3     Batman  40.0  Del

**Method-3**

- bfill
- ffill
- pad
- backfill

In [11]:
d1.fillna(method='bfill')
# It will fill with below value or next value
# Column1: Names index 4 is missing values it is filled with index 3 value
# Column2: Age index 4 is missing values it is filled with index 3 value
# Column3: City index 4 is missing values it should be fill with next value

C:\Users\dasar\AppData\Local\Temp\ipykernel_11072\1914124427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

       Names   Age City
0  Arghyanil  27.0  Hyd
1   Sangeeta  28.0  Jrd
2      Rohit  26.0  Ghy
3        NaN   NaN  Del

In [15]:
d1.fillna(method='bfill',axis=1)
# axis=1 means columns
# so NAn values fill with next values

C:\Users\dasar\AppData\Local\Temp\ipykernel_11072\981496262.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

       Names   Age City
0  Arghyanil  27.0  Hyd
1   Sangeeta  28.0  Jrd
2      Rohit  26.0  Ghy
3        Del   Del  Del

- backfill and bfill with Next value
- pad and ffill fill with previous value
- but it will change based on axis

In [12]:
d1.fillna(method='pad')

C:\Users\dasar\AppData\Local\Temp\ipykernel_11072\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

       Names   Age City
0  Arghyanil  27.0  Hyd
1   Sangeeta  28.0  Jrd
2      Rohit  26.0  Ghy
3      Rohit  26.0  Del

**Mean,Median & Mode**

**Method-4**
- mean
    - Numerical values can fill with mean value
    - but mean affect by outliers
    - if we don't have outliers it is best one
- median
    - Numerical values can fill with median value
    - we know that median value does not affect with outliers
    - so if outliers are there we can go with median
- mode
    - mode is useful for categorical data

In [16]:
dict1={'Names':['Arghyanil','Sangeeta','Rohit',np.nan],'Age':[27,28,26,np.nan],'City':['Hyd','Jrd','Ghy','Del']}
d1=pd.DataFrame(dict1)
d1

       Names   Age City
0  Arghyanil  27.0  Hyd
1   Sangeeta  28.0  Jrd
2      Rohit  26.0  Ghy
3        NaN   NaN  Del

In [17]:
# We already know we can fill with some values based on specific column using fillna
# d1.fillna(<random_number>)
# d1 represents all the columns
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    27.0
1    28.0
2    26.0
3    27.0
Name: Age, dtype: float64

In [18]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    27.0
1    28.0
2    26.0
3    27.0
Name: Age, dtype: float64

In [19]:
age_mode=d1['Age'].mode()
d1['Age'].fillna(age_mode)

0    27.0
1    28.0
2    26.0
3     NaN
Name: Age, dtype: float64

In [20]:
d1['City'].mode()
# In this use case we are getting mode equal
# But in real time we will get clear mode value

0    Del
1    Ghy
2    Hyd
3    Jrd
Name: City, dtype: object

- Fill with Random value
- Fill with random value on specific value
- Fill with methods
    - bfill
    - ffill
    - pad
    - backfill
- Fill with
    -mean
    -median
    -mode

**Method-5**

**KNN imputer**

- KNN: K nearest Neighbours
- K is a hyper parameter means user can choose
- It is a distance metric: **Euclidean distance**
- KNN imputer will take the mean of the neighbour value
- The neighbours value can provided by using value =k
- It's under Sklearn package
- Under Sklearn we have Imputer method
- Under imputer method we have Knn Imputer
- Applicable only for numerical data

<img id="dimg_317" src="" class="YQ4gaf" height="203" style="object-position:41% 16%" width="248" alt="Distance Measures in Machine Learning ..." data-csiid="30" data-atf="4">

In [21]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['Age']])

array([[27.],
       [28.],
       [26.],
       [27.]])